---
kind: type
id: T:Autodesk.Revit.DB.Structure.RebarStyle
source: html/a9ac65a6-29e6-25e5-caca-502e21385f47.htm
---
# Autodesk.Revit.DB.Structure.RebarStyle

Describes the usage style of a RebarShape.
 The style affects the bend radius and the set of allowable hooks.
 It also affects Rebar instance auto-constraining behavior.

## Syntax (C#)
```csharp
public enum RebarStyle
```